---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.SetLayerModifiers(System.Collections.Generic.IList{Autodesk.Revit.DB.LayerModifier})
source: html/a0b736c7-a28e-4c5a-7b51-33aab7c32327.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.SetLayerModifiers Method

Sets a project layer modifier array to the layer info.

## Syntax (C#)
```csharp
public void SetLayerModifiers(
	IList<LayerModifier> layermodifiers
)
```

## Parameters
- **layermodifiers** (`System.Collections.Generic.IList < LayerModifier >`) - The project layer modifier array.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null